{"id":"a751a880-4a27-11ed-b627-197fe62c933d","updated_at":"2022-10-12T12:16:11.489Z","updated_by":"ctulhu","created_at":"2022-10-12T12:16:09.990Z","created_by":"ctulhu","name":"5xx Error - Possible DDoS Attack","tags":[],"interval":"1m","enabled":true,"description":"Possible Ongoing DDoS Attack due to lot of 5xx Errors","risk_score":21,"severity":"low","license":"","output_index":".siem-signals-default","meta":{"from":"1m","kibana_siem_app_url":"https://cyberops.mb.com.ph/app/security"},"author":[],"false_positives":[],"from":"now-120s","rule_id":"56abb3ab-f52d-44f8-9eed-47f26f2c622e","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"type":"threshold","language":"kuery","index":["logs-*"],"query":"(data_stream.dataset:nginx.access OR data_stream.dataset:nginx.error OR data_stream.dataset:nginx.ingress_controller)  AND url.original:*","filters":[{"meta":{"type":"phrases","key":"http.response.status_code","params":["502","503","504"],"alias":null,"negate":false,"disabled":false},"query":{"bool":{"should":[{"match_phrase":{"http.response.status_code":"502"}},{"match_phrase":{"http.response.status_code":"503"}},{"match_phrase":{"http.response.status_code":"504"}}],"minimum_should_match":1}},"$state":{"store":"appState"}}],"threshold":{"field":["http.response.status_code"],"value":250,"cardinality":[]},"throttle":"no_actions","actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0}
